<script lang="ts" setup>
    
</script>

<template>
    <footer>
        <div class="footer-section">
            <div class="footer-section__container container">
                <div class="footer-section__info">
                    <div class="footer-section__logo">
                        <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21 0C16.6816 0 13.0351 2.62766 11.8555 6.23378C7.29988 6.89686 3.81818 10.513 3.81818 14.8752C3.81818 15.702 3.94365 16.5034 4.17848 17.2635C1.65819 18.8371 0 21.4903 0 24.5003C0 29.3329 4.27365 33.2505 9.54545 33.2505H15.2727V38.5C15.2727 40.433 16.9822 42 19.0909 42H22.9091C25.0178 42 26.7273 40.433 26.7273 38.5V33.2505H32.4545C37.7264 33.2505 42 29.3329 42 24.5003C42 21.4903 40.3418 18.8371 37.8215 17.2635C38.0564 16.5034 38.1818 15.702 38.1818 14.8752C38.1818 10.513 34.7001 6.89686 30.1445 6.23378C28.9649 2.62766 25.3184 0 21 0ZM23.8636 33.2505V38.5C23.8636 38.9832 23.4363 39.375 22.9091 39.375H19.0909C18.5637 39.375 18.1364 38.9832 18.1364 38.5V33.2505H23.8636ZM14.4208 7.67336C14.9751 4.80417 17.7114 2.62504 21 2.62504C24.2886 2.62504 27.0249 4.80417 27.5792 7.67336C27.6962 8.27943 28.257 8.72952 28.9279 8.75582C32.4823 8.89517 35.3182 11.582 35.3182 14.8752C35.3182 15.7467 35.1205 16.5724 34.7654 17.3194C34.4611 17.9594 34.7566 18.7056 35.4377 19.0178C37.6335 20.0241 39.1364 22.1025 39.1364 24.5003C39.1364 27.8831 36.1448 30.6254 32.4545 30.6254H9.54545C5.85519 30.6254 2.86364 27.8831 2.86364 24.5003C2.86364 22.1025 4.36645 20.0241 6.56233 19.0178C7.24344 18.7056 7.53886 17.9594 7.23464 17.3194C6.8795 16.5724 6.68182 15.7467 6.68182 14.8752C6.68182 11.582 9.51769 8.89517 13.0721 8.75582C13.743 8.72952 14.3038 8.27943 14.4208 7.67336Z" fill="#2A521E"/>
                        </svg>
                        <span>Derev’Ya</span>
                    </div>
                    <div class="footer-section__desc">
                        Ведущее в России движение по экологически безопасному лесопосадке, восстановлению лесов и построению более зеленого будущего.
                    </div>
                </div>
                <div class="footer-section__info">
                    <span>Быстрые ссылки</span>
                    <ul>
                        <li>
                            <ElementLink>Домой</ElementLink>
                        </li>
                        <li>
                            <ElementLink>История</ElementLink>
                        </li>
                        <li>
                            <ElementLink>Видео</ElementLink>
                        </li>
                        <li>
                            <ElementLink>Статистика</ElementLink>
                        </li>
                        <li>
                            <ElementLink>Как это работает</ElementLink>
                        </li>
                        <li>
                            <ElementLink>Зарегестрируйтесь сейчас</ElementLink>
                        </li>
                    </ul>
                </div>
                <div class="footer-section__info contacts-info">
                    <span>Связаться с нами</span>
                    <ul>
                        <li>
                            info@derevya-russia.org
                        </li>
                        <li>
                            +7 (495) 123-45-67
                        </li>
                        <li>
                            Москва, Россия
                        </li>
                    </ul>
                </div>
                <div class="footer-section__info">
                    <div class="footer-section__info__contacts">
                        <span>Подпишитесь на нас</span>
                        <div class="footer-section__info__socials">
                            <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_160_630)">
                                <path d="M42 21.1279C42 9.53068 32.5972 0.12793 21 0.12793C9.40275 0.12793 0 9.53068 0 21.1279C0 31.6104 7.679 40.2974 17.7188 41.8724V27.1987H12.3865V21.1262H17.7188V16.5027C17.7188 11.2404 20.8547 8.33193 25.6515 8.33193C27.9475 8.33193 30.352 8.74318 30.352 8.74318V13.9109H27.7025C25.0933 13.9109 24.2795 15.5297 24.2795 17.1904V21.1279H30.1035L29.1725 27.2004H24.2795V41.8742C34.321 40.2974 42 31.6087 42 21.1279Z" fill="white"/>
                                </g>
                                <defs>
                                <clipPath id="clip0_160_630">
                                <rect width="42" height="42" fill="white"/>
                                </clipPath>
                                </defs>
                            </svg>
                            <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_160_632)">
                                <path d="M21 0C15.295 0 14.5828 0.02625 12.3427 0.126C10.1062 0.231 8.58375 0.58275 7.245 1.1025C5.86425 1.638 4.69175 2.35725 3.5245 3.5245C2.35725 4.69175 1.63625 5.8625 1.1025 7.245C0.58275 8.58375 0.22925 10.1062 0.126 12.3427C0.021 14.5828 0 15.295 0 21C0 26.705 0.02625 27.4173 0.126 29.6573C0.231 31.892 0.58275 33.4163 1.1025 34.755C1.638 36.134 2.35725 37.3083 3.5245 38.4755C4.69175 39.641 5.8625 40.3638 7.245 40.8975C8.5855 41.4155 10.108 41.7707 12.3427 41.874C14.5828 41.979 15.295 42 21 42C26.705 42 27.4173 41.9737 29.6573 41.874C31.892 41.769 33.4163 41.4155 34.755 40.8975C36.134 40.362 37.3083 39.641 38.4755 38.4755C39.641 37.3083 40.3638 36.1393 40.8975 34.755C41.4155 33.4163 41.7707 31.892 41.874 29.6573C41.979 27.4173 42 26.705 42 21C42 15.295 41.9737 14.5828 41.874 12.3427C41.769 10.108 41.4155 8.582 40.8975 7.245C40.362 5.86425 39.641 4.69175 38.4755 3.5245C37.3083 2.35725 36.1393 1.63625 34.755 1.1025C33.4163 0.58275 31.892 0.22925 29.6573 0.126C27.4173 0.021 26.705 0 21 0ZM21 3.78C26.6052 3.78 27.2738 3.808 29.4875 3.90425C31.535 4.0005 32.6462 4.34 33.3848 4.6305C34.3682 5.01025 35.0648 5.46525 35.8032 6.1985C36.5365 6.9335 36.9915 7.63175 37.3713 8.61525C37.6582 9.35375 38.0013 10.465 38.094 12.5125C38.1937 14.728 38.2165 15.393 38.2165 21C38.2165 26.607 38.1903 27.2738 38.087 29.4875C37.9803 31.535 37.639 32.6462 37.3503 33.3848C36.9583 34.3682 36.512 35.0648 35.777 35.8032C35.0438 36.5365 34.335 36.9915 33.362 37.3713C32.627 37.6582 31.4983 38.0013 29.4508 38.094C27.2213 38.1937 26.565 38.2165 20.9475 38.2165C15.3283 38.2165 14.672 38.1903 12.4443 38.087C10.395 37.9803 9.26625 37.639 8.53125 37.3503C7.5355 36.9583 6.85125 36.512 6.118 35.777C5.38125 35.0438 4.9105 34.335 4.543 33.362C4.25425 32.627 3.91475 31.4983 3.808 29.4508C3.72925 27.2458 3.70125 26.565 3.70125 20.9737C3.70125 15.3807 3.72925 14.6982 3.808 12.467C3.91475 10.4195 4.25425 9.2925 4.543 8.5575C4.9105 7.56 5.38125 6.8775 6.118 6.14075C6.85125 5.4075 7.5355 4.935 8.53125 4.56925C9.26625 4.27875 10.3705 3.9375 12.418 3.8325C14.6493 3.75375 15.3055 3.7275 20.9212 3.7275L21 3.78ZM21 10.2165C15.0413 10.2165 10.2165 15.0465 10.2165 21C10.2165 26.9587 15.0465 31.7835 21 31.7835C26.9587 31.7835 31.7835 26.9535 31.7835 21C31.7835 15.0413 26.9535 10.2165 21 10.2165ZM21 28C17.1325 28 14 24.8675 14 21C14 17.1325 17.1325 14 21 14C24.8675 14 28 17.1325 28 21C28 24.8675 24.8675 28 21 28ZM34.7305 9.79125C34.7305 11.1825 33.6 12.3112 32.2105 12.3112C30.8193 12.3112 29.6905 11.1807 29.6905 9.79125C29.6905 8.40175 30.821 7.273 32.2105 7.273C33.5983 7.27125 34.7305 8.40175 34.7305 9.79125Z" fill="white"/>
                                </g>
                                <defs>
                                <clipPath id="clip0_160_632">
                                <rect width="42" height="42" fill="white"/>
                                </clipPath>
                                </defs>
                            </svg>
                            <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M41.1215 10.8259C40.8842 9.93208 40.4163 9.11634 39.7646 8.46031C39.1128 7.80428 38.3002 7.331 37.408 7.08785C34.1337 6.2041 21 6.2041 21 6.2041C21 6.2041 7.86625 6.2041 4.59025 7.08785C3.69846 7.33143 2.88626 7.80488 2.23489 8.46087C1.58351 9.11685 1.11578 9.93237 0.8785 10.8259C0 14.1229 0 21.0004 0 21.0004C0 21.0004 0 27.8778 0.8785 31.1749C1.11578 32.0686 1.58371 32.8844 2.23543 33.5404C2.88716 34.1964 3.69981 34.6697 4.592 34.9129C7.86625 35.7966 21 35.7966 21 35.7966C21 35.7966 34.1338 35.7966 37.4098 34.9129C38.302 34.6699 39.1148 34.1966 39.7665 33.5406C40.4183 32.8845 40.8861 32.0687 41.1233 31.1749C42 27.8778 42 21.0004 42 21.0004C42 21.0004 42 14.1229 41.1215 10.8259ZM16.7038 27.2444V14.7564L27.6815 21.0004L16.7038 27.2444Z" fill="white"/>
                            </svg>
                        </div>
                    </div>
                    <div class="footer-section__info__social-desc">
                        Присоединяйтесь к нашему сообществу и будьте в курсе предстоящих событий и новостей из мира экологии.
                    </div>
                </div>
            </div>
        </div>
    </footer>
</template>

<style lang="scss">
    .footer-section {
        background-color: #5EA500;
        &__container {
            padding: 6.25rem 0;
            @include grid(4, 1.5rem);
            @include mobile {
                @include df_fdc;
                gap: 1.33rem;
                padding: 3rem 0 1.33rem;
            }
        }
        &__info {
            @include df_fdc;
            gap: 1.5rem;
            &:first-of-type {
                @include mobile {
                    max-width: 50%;
                }
            }
            span {
                font-size: 2rem;
                font-weight: 600;
                line-height: 110%;
                color: #fff;
                @include mobile {
                    font-size: 1rem;
                }
            }
            ul {
                @include df_fdc;
                gap: 1.125rem;
                li {
                    .link {
                        color: #fff;
                        &::after {
                            background-color: #fff;
                        }
                    }
                }
            }
            &.contacts-info {
                ul {
                    gap: 0;
                    li {
                        list-style: disc;
                        margin-left: 1.25rem;
                        color: #fff;
                        font-size: 1.5rem;
                        font-weight: 400;
                        line-height: 110%;
                        @include mobile {
                            font-size: 1rem;
                        }
                    }
                }
            }
            &__contacts {
                @include df_fdc;
                gap: .5rem;
            }
            &__socials {
                @include df_ac;
                gap: 1.25rem;
                svg {
                    height: 2.625rem;
                    width: 2.625rem;
                    @include mobile {
                        height: 2rem;
                        width: 2rem;
                    }
                }
            }
            &__social-desc {
                color: #fff;
                font-size: 1.5rem;
                font-weight: 500;
                line-height: 110%;
                @include mobile {
                    font-size: 0.83rem;
                }
            }
        }
        &__logo {
            @include df_ac;
            gap: .75rem;
            @include mobile {
                gap: .25rem;
            }
            svg {
                height: 2.625rem;
                width: 2.625rem;
                @include mobile {
                    height: 2.33rem;
                    width: 2.33rem;
                }
            }
            span {
                font-size: 2rem;
                font-weight: 400;
                line-height: 110%;
                color: #fff;
                @include mobile {
                    font-size: 1rem;
                }
            }
        }
        &__desc {
            font-size: 1.5rem;
            font-weight: 400;
            line-height: 110%;
            color: #fff;
            @include mobile {
                font-size: 1rem;
            }
        }
    }
</style>